// *++
//
// Copyright (c) 2005 - 2007, Intel Corporation                                                         
// All rights reserved. This program and the accompanying materials                          
// are licensed and made available under the terms and conditions of the BSD License         
// which accompanies this distribution. The full text of the license may be found at         
// http://opensource.org/licenses/bsd-license.php                                            
//                                                                                           
// THE PROGRAM IS DISTRIBUTED UNDER THE BSD LICENSE ON AN "AS IS" BASIS,                     
// WITHOUT WARRANTIES OR REPRESENTATIONS OF ANY KIND, EITHER EXPRESS OR IMPLIED.             
// 
// Module Name:
//
//   SmBiosViewStrings.uni
// 
// Abstract:
// 
//   String definitions for the Shell smbiosview command
// 
// Revision History:
// 
// --*/


/=#

#langdef eng "English"

#string STR_SMBIOSVIEW_EVENTLOGINFO_ACCESS_METHOD				#language eng  "Access method: "

#string STR_SMBIOSVIEW_EVENTLOGINFO_ONE_EIGHT_BIT				#language eng  "Indexed I/O: 1 8-bit index port, 1 8-bit data port\n"

#string STR_SMBIOSVIEW_EVENTLOGINFO_TWO_EIGHT_BITS				#language eng  "Indexed I/O: 2 8-bit index ports, 1 8-bit data port\n"

#string STR_SMBIOSVIEW_EVENTLOGINFO_ONE_SIXTEEN_BIT				#language eng  "Indexed I/O: 1 16-bit index port, 1 8-bit data port\n"

#string STR_SMBIOSVIEW_EVENTLOGINFO_MEM_MAPPED_PHYS				#language eng  "Memory-mapped physical 32-bit address\n"

#string STR_SMBIOSVIEW_EVENTLOGINFO_AVAIL_VIA_GENERAL			#language eng  "Available via General-Purpose NonVolatile Data functions\n"

#string STR_SMBIOSVIEW_EVENTLOGINFO_AVAIL_FOR_FUTURE_ASSIGN		#language eng  "Available for future assignment via this specification\n"

#string STR_SMBIOSVIEW_EVENTLOGINFO_BIOS_VENDOR_OEM				#language eng  "BIOS Vendor/OEM-specific \n"

#string STR_SMBIOSVIEW_EVENTLOGINFO_LOG_STATUS					#language eng  "Log Status: "

#string STR_SMBIOSVIEW_EVENTLOGINFO_LOG_AREA_VALID				#language eng  "Log area valid\n"

#string STR_SMBIOSVIEW_EVENTLOGINFO_LOG_AREA_FULL				#language eng  "Log area full\n"

#string STR_SMBIOSVIEW_EVENTLOGINFO_LOG_AREA_NOT_FULL			#language eng  "Log area not full\n"

#string STR_SMBIOSVIEW_EVENTLOGINFO_RES_BITS_NOT_ZERO			#language eng  "Reserved bits not zero - 0x%x\n"

#string STR_SMBIOSVIEW_EVENTLOGINFO_LOG_HEADER_FORMAT			#language eng  "Log Header Format: \n"

#string STR_SMBIOSVIEW_EVENTLOGINFO_NO_HEADER					#language eng  "No Header\n"

#string STR_SMBIOSVIEW_EVENTLOGINFO_TYPE_LOG_HEADER				#language eng  "Type 1 log header\n"

#string STR_SMBIOSVIEW_EVENTLOGINFO_AVAIL_FOR_FUTURE			#language eng  "Available for future\n"

#string STR_SMBIOSVIEW_EVENTLOGINFO_BIOS_VENDOR					#language eng  "BIOS Vendor/OEM-specific format\n"

#string STR_SMBIOSVIEW_EVENTLOGINFO_LOG_HEADER_LEN				#language eng  "Log Header Len: "

#string STR_SMBIOSVIEW_EVENTLOGINFO_ONE_VAR_D					#language eng  " %d\n"

#string STR_SMBIOSVIEW_EVENTLOGINFO_THIS_RECORD_READ			#language eng  "This record has been read\n"

#string STR_SMBIOSVIEW_EVENTLOGINFO_THIS_RECORD_NOT_READ		#language eng  "This record has not been read\n"

#string STR_SMBIOSVIEW_EVENTLOGINFO_SYSTEM_EVENT_LOG			#language eng  "System Event Log Header Type1 Format:\n"

#string STR_SMBIOSVIEW_EVENTLOGINFO_OEM_RESERVED				#language eng  "OEM Reserved:\n0x%x 0x%x 0x%x 0x%x 0x%x\n"

#string STR_SMBIOSVIEW_EVENTLOGINFO_MULTIPLE_EVENT_TIME			#language eng  "Multiple Event Time Window: 0x%x\n"

#string STR_SMBIOSVIEW_EVENTLOGINFO_MULTIPLE_EVENT_COUNT		#language eng  "Multiple Event Count Increment: 0x%x\n"

#string STR_SMBIOSVIEW_EVENTLOGINFO_PREBOOT_ADDRESS				#language eng  "Pre-boot Event Log Reset - CMOS Address: 0x%x\n"

#string STR_SMBIOSVIEW_EVENTLOGINFO_PREBOOT_INDEX				#language eng  "Pre-boot Event Log Reset - CMOS Bit Index: 0x%x\n"

#string STR_SMBIOSVIEW_EVENTLOGINFO_CHECKSUM_STARTING_OFF		#language eng  "CMOS Checksum - Starting Offset: 0x%x\n"

#string STR_SMBIOSVIEW_EVENTLOGINFO_CHECKSUN_BYTE_COUNT			#language eng  "CMOS Checksum - Byte Count: 0x%x\n"

#string STR_SMBIOSVIEW_EVENTLOGINFO_RESERVED					#language eng  "Reserved: 0x%x 0x%x 0x%x\n"

#string STR_SMBIOSVIEW_EVENTLOGINFO_HEADER_REVISION				#language eng  "HeaderRevision: 0x%x\n"

#string STR_SMBIOSVIEW_EVENTLOGINFO_LOG_HEADER					#language eng  "\nLog Header: "

#string STR_SMBIOSVIEW_EVENTLOGINFO_AVAIL_FUTURE_ASSIGN			#language eng  "Available for future assignment via this specification\n"

#string STR_SMBIOSVIEW_EVENTLOGINFO_NO_STD_FORMAT				#language eng  "No standard format data is available\n"

#string STR_SMBIOSVIEW_EVENTLOGINFO_SMBIOS_STRUCT_ASSOC			#language eng  "SMBIOS structure associated with the hardware element that failed\n"

#string STR_SMBIOSVIEW_EVENTLOGINFO_STRUCT_HANDLE				#language eng  "Structure handle = 0x%x\n"

#string STR_SMBIOSVIEW_EVENTLOGINFO_MULT_EVENT_COUNTER			#language eng  "multiple-event counter: 0x%x\n"

#string STR_SMBIOSVIEW_EVENTLOGINFO_UNUSED_AVAIL_FOR_ASSIGN		#language eng  "Unused, available for assignment by this specification\n"

#string STR_SMBIOSVIEW_EVENTLOGINFO_AVAIL_FOR_SYSTEM			#language eng  "Available for system- and OEM-specific assignments\n"

#string STR_SMBIOSVIEW_EVENTLOGINFO_SYSTEM_EVENT_LOG_2			#language eng  "\nSystem Event Log records:\n"

#string STR_SMBIOSVIEW_EVENTLOGINFO_DATE						#language eng  "Date/Time: "

#string STR_SMBIOSVIEW_EVENTLOGINFO_ERROR						#language eng  "error"

#string STR_SMBIOSVIEW_EVENTLOGINFO_TIME_SIX_VARS				#language eng  "%02x/%02x/%02x, %x:%x:%x\n"

#string STR_SMBIOSVIEW_LIBSMBIOSVIEW_CANNOT_GET_TABLE			#language eng  "Cannot get SMBIOS Table\n"

#string STR_SMBIOSVIEW_LIBSMBIOSVIEW_GET_TABLE_ERROR			#language eng  "Get SMBIOS Table error - %r\n"

#string STR_SMBIOSVIEW_LIBSMBIOSVIEW_NO_BUFF_SPEC				#language eng  " Get SMBIOS Structure, no buffer specified!\n"

#string STR_SMBIOSVIEW_PRINTINFO_DUMP							#language eng  "Dump "

#string STR_SMBIOSVIEW_PRINTINFO_SIZE							#language eng  "\nsize=%d:\n"

#string STR_SMBIOSVIEW_PRINTINFO_SMBIOSTABLE_NULL				#language eng  "SMBiosTable is NULL!\n"

#string STR_SMBIOSVIEW_PRINTINFO_ENTRY_POINT_SIGN				#language eng  "%HSMBIOS Entry Point Structure:%N\n"

#string STR_SMBIOSVIEW_PRINTINFO_BCD_REVISION					#language eng  "SMBIOS BCD Revision:  0x%x\n"

#string STR_SMBIOSVIEW_PRINTINFO_NUMBER_STRUCT					#language eng  "Number of Structures: %d\n"

#string STR_SMBIOSVIEW_PRINTINFO_MAX_STRUCT_SIZE				#language eng  "Max Struct size:      %d\n"

#string STR_SMBIOSVIEW_PRINTINFO_TABLE_ADDR						#language eng  "Table Address:        0x%x\n"

#string STR_SMBIOSVIEW_PRINTINFO_TABLE_LENGTH					#language eng  "Table Length:         %d\n"

#string STR_SMBIOSVIEW_PRINTINFO_ANCHOR_STR						#language eng  "Anchor String:        %a\n"

#string STR_SMBIOSVIEW_PRINTINFO_EPS_CHECKSUM					#language eng  "EPS Checksum:         0x%x\n"

#string STR_SMBIOSVIEW_PRINTINFO_ENTRY_POINT_LEN				#language eng  "Entry Point Len:      %d\n"

#string STR_SMBIOSVIEW_PRINTINFO_VERSION						#language eng  "Version:              %d.%d\n"

#string STR_SMBIOSVIEW_PRINTINFO_MAJOR_VERSION					#language eng  "Major version:        %d\n"

#string STR_SMBIOSVIEW_PRINTINFO_MINOR_VERSION					#language eng  "Minor version:        %d\n"

#string STR_SMBIOSVIEW_PRINTINFO_ENTRY_POINT_REVISION			#language eng  "Entry Point revision: 0x%x\n"

#string STR_SMBIOSVIEW_PRINTINFO_FORMATTED_AREA_NONE			#language eng  "Formatted Area:        None\n"

#string STR_SMBIOSVIEW_PRINTINFO_FORMATTED_AREA					#language eng  "Formatted Area:  \n"

#string STR_SMBIOSVIEW_PRINTINFO_INTER_ACHOR					#language eng  "Inter Anchor:         %a\n"

#string STR_SMBIOSVIEW_PRINTINFO_INTER_CHECKSUM					#language eng  "Inter Checksum:       0x%x\n"

#string STR_SMBIOSVIEW_PRINTINFO_FORMAT_PART_LEN				#language eng  "Format part Len : %d\n"

#string STR_SMBIOSVIEW_PRINTINFO_STRUCT_HANDLE					#language eng  "Structure Handle: %d\n"

#string STR_SMBIOSVIEW_PRINTINFO_BOOTUP_STATE					#language eng  "Bootup state "

#string STR_SMBIOSVIEW_PRINTINFO_POWER_SUPPLY_STATE				#language eng  "Power Supply State "

#string STR_SMBIOSVIEW_PRINTINFO_THERMAL_STATE					#language eng  "Thermal state "

#string STR_SMBIOSVIEW_PRINTINFO_SECURITY_STATUS				#language eng  "Security Status "

#string STR_SMBIOSVIEW_PRINTINFO_SUPOPRT						#language eng  "Support "

#string STR_SMBIOSVIEW_PRINTINFO_CURRENT						#language eng  "Current "

#string STR_SMBIOSVIEW_PRINTINFO_INSTALLED						#language eng  "Installed "

#string STR_SMBIOSVIEW_PRINTINFO_ENABLED						#language eng  "Enabled "

#string STR_SMBIOSVIEW_PRINTINFO_EXTERNAL						#language eng  "External "

#string STR_SMBIOSVIEW_PRINTINFO_DESC_STRING					#language eng  "Description String: "

#string STR_SMBIOSVIEW_PRINTINFO_SUPOPRTED_EVENT				#language eng  "Supported Event Log Type Descriptors %d:\n"

#string STR_SMBIOSVIEW_PRINTINFO_ACCESS_METHOD_NOT_SUPOPRTED	#language eng  "Access Method %d has not supported\n"

#string STR_SMBIOSVIEW_PRINTINFO_STRUCT_TYPE31					#language eng  "This structure is Type31, reserved by BIS (Boot Integrity Services)\n"

#string STR_SMBIOSVIEW_PRINTINFO_MEM_DEVICE						#language eng  "Memory Device %d:\n"

#string STR_SMBIOSVIEW_PRINTINFO_DEV_LOAD						#language eng  "Device Load: 0x%02x,"

#string STR_SMBIOSVIEW_PRINTINFO_DEV_HANDLE						#language eng  "Device Handle: 0x%04x\n"

#string STR_SMBIOSVIEW_PRINTINFO_INACTIVE_STRUCT				#language eng  "Inactive structure --- Needn't interpret it.\n"

#string STR_SMBIOSVIEW_PRINTINFO_THIS_STRUCT_END_TABLE			#language eng  "This structure indicates the End-of-table!\n"

#string STR_SMBIOSVIEW_PRINTINFO_STRUCT_TYPE_UNDEFINED			#language eng  "Structure Type undefined!\n"

#string STR_SMBIOSVIEW_PRINTINFO_BIOS_CHAR						#language eng  "BIOS Characteristics: \n"

#string STR_SMBIOSVIEW_PRINTINFO_RESERVED_BIT					#language eng  "Reserved bit\n"

#string STR_SMBIOSVIEW_PRINTINFO_UNKNOWN_BIT					#language eng  "Unknown bit\n"

#string STR_SMBIOSVIEW_PRINTINFO_BIOS_CHAR_NOT_SUPPORTED		#language eng  "BIOS Characteristics Not Supported\n"

#string STR_SMBIOSVIEW_PRINTINFO_ISA_SUPPORTED					#language eng  "ISA is supported\n"

#string STR_SMBIOSVIEW_PRINTINFO_MSA_SUPPORTED					#language eng  "MSA is supported\n"

#string STR_SMBIOSVIEW_PRINTINFO_EISA_SUPPORTED					#language eng  "EISA is supported\n"

#string STR_SMBIOSVIEW_PRINTINFO_PCI_SUPPORTED					#language eng  "PCI is supported\n"

#string STR_SMBIOSVIEW_PRINTINFO_PC_CARD_SUPPORTED				#language eng  "PC Card(PCMCIA) is supported\n"

#string STR_SMBIOSVIEW_PRINTINFO_PLUG_PLAY_SUPPORTED			#language eng  "Plug and play is supported\n"

#string STR_SMBIOSVIEW_PRINTINFO_APM_SUPPORTED					#language eng  "APM is supported\n"

#string STR_SMBIOSVIEW_PRINTINFO_BIOS_UPGRADEABLE				#language eng  "BIOS is Upgradeable(FLASH)\n"

#string STR_SMBIOSVIEW_PRINTINFO_BIOS_SHADOWING					#language eng  "BIOS shadowing is allowed\n"

#string STR_SMBIOSVIEW_PRINTINFO_VESA_SUPPORTED					#language eng  "VL-VESA is supported\n"

#string STR_SMBIOSVIEW_PRINTINFO_ECSD_SUPPORT					#language eng  "ESCD support is available\n"

#string STR_SMBIOSVIEW_PRINTINFO_BOOT_FORM_CD_SUPPORTED			#language eng  "Boot form CD is supported\n"

#string STR_SMBIOSVIEW_PRINTINFO_SELECTED_BOOT_SUPPORTED		#language eng  "Selectable Boot is supported\n"

#string STR_SMBIOSVIEW_PRINTINFO_BIOS_ROM_SOCKETED				#language eng  "BIOS ROM is socketed\n"

#string STR_SMBIOSVIEW_PRINTINFO_BOOT_FROM_PC_CARD				#language eng  "Boot From PC Card(PCMCIA)is supported\n"

#string STR_SMBIOSVIEW_PRINTINFO_EDD_ENHANCED_DRIVER			#language eng  "EDD Enhanced Disk Driver) Specification is supported\n"

#string STR_SMBIOSVIEW_PRINTINFO_JAPANESE_FLOPPY_NEC			#language eng  "Int 13h - Japanese Floppy for NEC 9800 1.2mb (3.5\",1k Bytes/Sector, 360 RPM) is supported\n"

#string STR_SMBIOSVIEW_PRINTINFO_JAPANESE_FLOPPY_TOSHIBA		#language eng  "Int 13h - Japanese Floppy for Toshiba 1.2mn (3.5\", 360 RPM) is supported\n"

#string STR_SMBIOSVIEW_PRINTINFO_FLOPPY_SERVICES_SUPPORTED		#language eng  "Int 13h - 5.25\"/360KB Floppy Services are supported\n"

#string STR_SMBIOSVIEW_PRINTINFO_ONE_POINT_TWO_MB				#language eng  "Int 13h - 5.25\"/1.2MB Floppy services are supported\n"

#string STR_SMBIOSVIEW_PRINTINFO_720_KB							#language eng  "Int 13h - 3.5\"/720KB Floppy services are supported\n"

#string STR_SMBIOSVIEW_PRINTINFO_TWO_POINT_EIGHT_EIGHT_MB		#language eng  "Int 13h - 3.5\"/2.88MB Floppy services are supported\n"

#string STR_SMBIOSVIEW_PRINTINFO_PRINT_SCREEN_SUPPORT			#language eng  "Int 5h, Print screen Services is supported\n"

#string STR_SMBIOSVIEW_PRINTINFO_KEYBOARD_SERV_SUPPORT			#language eng  "Int 9h, 8042 Keyboard services are supported\n"

#string STR_SMBIOSVIEW_PRINTINFO_SERIAL_SERVICES_SUPPORT		#language eng  "Int 14h, Serial Services are supported\n"

#string STR_SMBIOSVIEW_PRINTINFO_PRINTER_SERVICES_SUPPORT		#language eng  "Int 17h, Printer services are supported\n"

#string STR_SMBIOSVIEW_PRINTINFO_MONO_VIDEO_SUPPORT				#language eng  "Int 10h, CGA/Mono Video services are supported2\n"

#string STR_SMBIOSVIEW_PRINTINFO_NEC_PC_98						#language eng  "NEC PC-98\n"

#string STR_SMBIOSVIEW_PRINTINFO_BITS_32_47						#language eng  " Bits 32:47 are reserved for BIOS Vendor\n"

#string STR_SMBIOSVIEW_PRINTINFO_BITS_48_64						#language eng  " Bits 48:64 are reserved for System Vendor\n"

#string STR_SMBIOSVIEW_PRINTINFO_BIOS_CHAR_EXTENSION			#language eng  "BIOS Characteristics Extension Byte1:\n"

#string STR_SMBIOSVIEW_PRINTINFO_ACPI_SUPPORTED					#language eng  "ACPI supported\n"

#string STR_SMBIOSVIEW_PRINTINFO_USB_LEGACY_SUPPORTED			#language eng  "USB Legacy is supported\n"

#string STR_SMBIOSVIEW_PRINTINFO_AGP_SUPPORTED					#language eng  "AGP is supported\n"

#string STR_SMBIOSVIEW_PRINTINFO_I2O_BOOT_SUPPORTED				#language eng  "I2O boot is supported\n"

#string STR_SMBIOSVIEW_PRINTINFO_LS_120_BOOT_SUPPORTED			#language eng  "LS-120 boot is supported\n"

#string STR_SMBIOSVIEW_PRINTINFO_ATAPI_ZIP_DRIVE				#language eng  "ATAPI ZIP Drive boot is supported\n"

#string STR_SMBIOSVIEW_PRINTINFO_1394_BOOT_SUPPORTED			#language eng  "1394 boot is supported\n"

#string STR_SMBIOSVIEW_PRINTINFO_SMART_BATTERY_SUPPORTED		#language eng  "Smart battery supported\n"

#string STR_SMBIOSVIEW_PRINTINFO_BIOS_CHAR_EXTENSION_2			#language eng  "BIOS Characteristics Extension Byte2:\n"

#string STR_SMBIOSVIEW_PRINTINFO_BIOS_BOOT_SPEC_SUPP			#language eng  "BIOS Boot Specification supported\n"

#string STR_SMBIOSVIEW_PRINTINFO_FUNCTION_KEY_INIT				#language eng  "Function key-initiated Network Service boot supported\n"

#string STR_SMBIOSVIEW_PRINTINFO_BITS_RSVD_FOR_FUTURE			#language eng  " Bits 2:7 are reserved for future assignment\n"

#string STR_SMBIOSVIEW_PRINTINFO_PROCESSOR_FAMILY				#language eng  "Processor Family:"

#string STR_SMBIOSVIEW_PRINTINFO_OTHER							#language eng  "Other\n"

#string STR_SMBIOSVIEW_PRINTINFO_UNKNOWN						#language eng  "Unknown\n"

#string STR_SMBIOSVIEW_PRINTINFO_INTEL386_PROCESSOR				#language eng  "Intel386(TM) Processor\n"

#string STR_SMBIOSVIEW_PRINTINFO_INTEL486_PROCESSOR				#language eng  "Intel486(TM) Processor\n"

#string STR_SMBIOSVIEW_PRINTINFO_PENTIUM_PROC_FAMILY			#language eng  "Pentium(R) Processor Family\n"

#string STR_SMBIOSVIEW_PRINTINFO_PENTIUM_PRO_PROC				#language eng  "Pentium(R) Pro processor\n"

#string STR_SMBIOSVIEW_PRINTINFO_PENTIUM_II_PROC				#language eng  "Pentium(R) II processor\n"

#string STR_SMBIOSVIEW_PRINTINFO_PENTIUM_PROC_MMX				#language eng  "Pentium(R) processor with MMX(TM) technology\n"

#string STR_SMBIOSVIEW_PRINTINFO_CELERON_PROC					#language eng  "Celeron(TM) processor\n"

#string STR_SMBIOSVIEW_PRINTINFO_PENTIUM_XEON_PROC				#language eng  "Pentium(R) II Xeon(TM) processor\n"

#string STR_SMBIOSVIEW_PRINTINFO_PENTIUM_III_PROC				#language eng  "Pentium(R) III Processor\n"

#string STR_SMBIOSVIEW_PRINTINFO_M1_FAMILY						#language eng  "M1 Family\n"

#string STR_SMBIOSVIEW_PRINTINFO_K5_FAMILY						#language eng  "K5 Family\n"

#string STR_SMBIOSVIEW_PRINTINFO_POWER_PC_FAMILY				#language eng  "Power PC Family\n"

#string STR_SMBIOSVIEW_PRINTINFO_POWER_PC_601					#language eng  "Power PC 601\n"

#string STR_SMBIOSVIEW_PRINTINFO_POWER_PC_603					#language eng  "Power PC 603\n"

#string STR_SMBIOSVIEW_PRINTINFO_POWER_PC_603_PLUS				#language eng  "Power PC 603+\n"

#string STR_SMBIOSVIEW_PRINTINFO_POWER_PC_604					#language eng  "Power PC 604\n"

#string STR_SMBIOSVIEW_PRINTINFO_ALPHA_FAMILY_2					#language eng  "Alpha Family 2\n"

#string STR_SMBIOSVIEW_PRINTINFO_MIPS_FAMILY					#language eng  "MIPS Family\n"

#string STR_SMBIOSVIEW_PRINTINFO_SPARC_FAMILY					#language eng  "SPARC Family\n"

#string STR_SMBIOSVIEW_PRINTINFO_68040_FAMILY					#language eng  "68040 Family\n"

#string STR_SMBIOSVIEW_PRINTINFO_HOBBIT_FAMILY					#language eng  "Hobbit Family\n"

#string STR_SMBIOSVIEW_PRINTINFO_WEITEK							#language eng  "Weitek\n"

#string STR_SMBIOSVIEW_PRINTINFO_PA_RISC_FAMILY					#language eng  "PA-RISC Family\n"

#string STR_SMBIOSVIEW_PRINTINFO_V30_FAMILY						#language eng  "V30 Family\n"

#string STR_SMBIOSVIEW_PRINTINFO_PENTIUM_III_XEON				#language eng  "Pentium(R) III Xeon(TM) Processor\n"

#string STR_SMBIOSVIEW_PRINTINFO_RSVD_FOR_SPEC_M1				#language eng  "Reserved for specific M1 versions\n"

#string STR_SMBIOSVIEW_PRINTINFO_RSVD_FOR_SPEC_K5				#language eng  "Reserved for specific K5 versions\n"

#string STR_SMBIOSVIEW_PRINTINFO_RSVD_FOR_SPEC_PENTIUM			#language eng  "Reserved for specific Pentium(R) Processor versions\n"

#string STR_SMBIOSVIEW_PRINTINFO_UNDEFINED_PROC_FAMILY			#language eng  "Undefined processor family and type\n"

#string STR_SMBIOSVIEW_PRINTINFO_PROC_INFO						#language eng  "Processor Information -  Voltage:\n"

#string STR_SMBIOSVIEW_PRINTINFO_PROC_CURRENT_VOLTAGE			#language eng  "Processor current voltage = (%d/10)V\n"

#string STR_SMBIOSVIEW_PRINTINFO_5V_SUPOPRTED					#language eng  " 5V is supported\n"

#string STR_SMBIOSVIEW_PRINTINFO_33V_SUPPORTED					#language eng  " 3.3V is supported\n"

#string STR_SMBIOSVIEW_PRINTINFO_29V_SUPPORTED					#language eng  " 2.9V is supported\n"

#string STR_SMBIOSVIEW_PRINTINFO_BIT3_NOT_ZERO					#language eng  " Bit3 not zero, reserved zero bits\n"

#string STR_SMBIOSVIEW_PRINTINFO_BIT4_NOT_ZERO					#language eng  " Bit4 not zero, reserved zero bits\n"

#string STR_SMBIOSVIEW_PRINTINFO_BIT5_NOT_ZERO					#language eng  " Bit5 not zero, reserved zero bits\n"

#string STR_SMBIOSVIEW_PRINTINFO_BIT6_NOT_ZERO					#language eng  " Bit6 not zero, reserved zero bits\n"

#string STR_SMBIOSVIEW_PRINTINFO_PROC_STATUS					#language eng  "Processor Status:\n"

#string STR_SMBIOSVIEW_PRINTINFO_ERROR_BIT7						#language eng  "Status Data error, BIT 7 must be zero\n"

#string STR_SMBIOSVIEW_PRINTINFO_ERROR_BIT5						#language eng  "Status Data error, BIT 5 must be zero\n"

#string STR_SMBIOSVIEW_PRINTINFO_ERROR_BIT4						#language eng  "Status Data error, BIT 4 must be zero\n"

#string STR_SMBIOSVIEW_PRINTINFO_ERROR_BIT3						#language eng  "Status Data error, BIT 3 must be zero\n"

#string STR_SMBIOSVIEW_PRINTINFO_CPU_SOCKET_POPULATED			#language eng  "CPU Socket Populated\n"

#string STR_SMBIOSVIEW_PRINTINFO_CPU_SOCKET_UNPOPULATED			#language eng  "CPU Socket Unpopulated Bits\n"

#string STR_SMBIOSVIEW_PRINTINFO_CPU_ENABLED					#language eng  "CPU Enabled\n"

#string STR_SMBIOSVIEW_PRINTINFO_CPU_DISABLED_BY_USER			#language eng  "CPU Disabled by User via BIOS Setup\n"

#string STR_SMBIOSVIEW_PRINTINFO_CPU_DIABLED_BY_BIOS			#language eng  "CPU Disabled By BIOS (POST Error)\n"

#string STR_SMBIOSVIEW_PRINTINFO_CPU_IDLE						#language eng  "CPU is Idle, waiting to be enabled\n"

#string STR_SMBIOSVIEW_PRINTINFO_OTHERS							#language eng  "Others\n"

#string STR_SMBIOSVIEW_PRINTINFO_RESERVED						#language eng  "Reserved\n"

#string STR_SMBIOSVIEW_PRINTINFO_SIZE_LARGEST_MEM				#language eng  "The size of the largest memory module supported (per slot): "

#string STR_SMBIOSVIEW_PRINTINFO_ONE_VAR_MB						#language eng  "%d * %d = %d MB\n"

#string STR_SMBIOSVIEW_PRINTINFO_MAX_AMOUNT_MEM					#language eng  "The maximum amount of memory supported by this controller: "

#string STR_SMBIOSVIEW_PRINTINFO_HANDLES_CONTROLLED				#language eng  "There are %d Handles controlled by this controller\n"

#string STR_SMBIOSVIEW_PRINTINFO_HANDLES_LIST_CONTROLLED		#language eng  "Handles' List controlled by this controller:\n"

#string STR_SMBIOSVIEW_PRINTINFO_HANDLE							#language eng  "Handle%d: 0x%04x\n"

#string STR_SMBIOSVIEW_PRINTINFO_BANK_CONNECTIONS				#language eng  "Bank Connections:"

#string STR_SMBIOSVIEW_PRINTINFO_BANK_RAS						#language eng  "Banks %d & %d(RAS# %d & %d)\n"

#string STR_SMBIOSVIEW_PRINTINFO_BANK_RAS_2						#language eng  "Bank %d(RAS# %d)\n"

#string STR_SMBIOSVIEW_PRINTINFO_NO_BANKS_CONNECTED				#language eng  "No banks connected\n"

#string STR_SMBIOSVIEW_PRINTINFO_MEMORY_SIZE					#language eng  "Memory Size:"

#string STR_SMBIOSVIEW_PRINTINFO_MEM_SIZE_NOT_DETERMINABLE		#language eng  " Memory Size Not determinable (Installed Size only)\n"

#string STR_SMBIOSVIEW_PRINTINFO_MODULE_INSTALLED				#language eng  " Module is installed, but no memory has been enabled\n"

#string STR_SMBIOSVIEW_PRINTINFO_NOT_INSTALLED					#language eng  " Not installed\n"

#string STR_SMBIOSVIEW_PRINTINFO_MEM_SIZE						#language eng  " Memory Size: %d MB\n"

#string STR_SMBIOSVIEW_PRINTINFO_MEM_MODULE_DOUBLE_BANK			#language eng  "The memory module has a Double-bank connection\n"

#string STR_SMBIOSVIEW_PRINTINFO_MEM_MODULE_SINGLE_BANK			#language eng  "The memory module has a Single-bank connection\n"

#string STR_SMBIOSVIEW_PRINTINFO_SLOT_ID						#language eng  " Slot Id:"

#string STR_SMBIOSVIEW_PRINTINFO_LOGICAL_MICRO_CHAN				#language eng  " the logical Micro Channel slot number is:"

#string STR_SMBIOSVIEW_PRINTINFO_ONE_VAR_D						#language eng  " %d\n"

#string STR_SMBIOSVIEW_PRINTINFO_ERROR_NOT_1_15					#language eng  " error, not 1-15.\n"

#string STR_SMBIOSVIEW_PRINTINFO_LOGICAL_EISA_NUM				#language eng  " the logical EISA slot number is:"

#string STR_SMBIOSVIEW_PRINTINFO_IDENTIFIES_ADAPTER_NUM			#language eng  " Identifies the Adapter Number is: %d\n"

#string STR_SMBIOSVIEW_PRINTINFO_VALUE_PRESENT					#language eng  " the value present in the Slot Number field of the PCI Interrupt Routing table entry that is associated with this slot is: %d\n"

#string STR_SMBIOSVIEW_PRINTINFO_UNDEFINED_SLOT_ID				#language eng  " undefined Slot Id\n"

#string STR_SMBIOSVIEW_PRINTINFO_SYSTEM_BOOT_STATUS				#language eng  "System Boot Status: "

#string STR_SMBIOSVIEW_PRINTINFO_NO_ERRORS_DETECTED				#language eng  " No errors detected"

#string STR_SMBIOSVIEW_PRINTINFO_NO_BOOTABLE_MEDIA				#language eng  " No bootable media"

#string STR_SMBIOSVIEW_PRINTINFO_NORMAL_OP_SYSTEM				#language eng  " The \"normal\" operating system failed to load."

#string STR_SMBIOSVIEW_PRINTINFO_FIRMWARE_DETECTED				#language eng  " Firmware-detected hardware failure, including \"unknown\" failure types."

#string STR_SMBIOSVIEW_PRINTINFO_OP_SYSTEM						#language eng  " Operating system-detected hardware failure."

#string STR_SMBIOSVIEW_PRINTINFO_USER_REQUESTED_BOOT			#language eng  " User-requested boot, usually via a keystroke"

#string STR_SMBIOSVIEW_PRINTINFO_SYSTEM_SECURITY_VIOLATION		#language eng  " System security violation"

#string STR_SMBIOSVIEW_PRINTINFO_PREV_REQ_IMAGE					#language eng  " Previously-requested image. "

#string STR_SMBIOSVIEW_PRINTINFO_WATCHDOG_TIMER					#language eng  " A system watchdog timer expired, causing the system to reboot."

#string STR_SMBIOSVIEW_PRINTINFO_RSVD_FUTURE_ASSIGNMENT			#language eng  " Reserved for future assignment via this specification. "

#string STR_SMBIOSVIEW_PRINTINFO_VENDOR_OEM_SPECIFIC			#language eng  " Vendor/OEM-specific implementations.  The Vendor/OEM identifier is the \"Manufacturer\" string found in the System Identification structure."

#string STR_SMBIOSVIEW_PRINTINFO_PRODUCT_SPEC_IMPLMENTATION		#language eng  "Product-specific implementations.  The product identifier is formed by the concatenation of the \"Manufacturer\" and \"Product Name\" strings found in the System Information structure."

#string STR_SMBIOSVIEW_PRINTINFO_ERROR_VALUE					#language eng  "Error value\n"

#string STR_SMBIOSVIEW_PRINTINFO_SBDS_MANUFACTURE_DATE			#language eng  "SBDS Manufacture Date: "

#string STR_SMBIOSVIEW_PRINTINFO_MONTH_DAY_YEAR					#language eng  "%02d/%02d/%4d\n"

#string STR_SMBIOSVIEW_PRINTINFO_SYSTEM_RESET_CAPABILITIES		#language eng  "System Reset Capabilities: "

#string STR_SMBIOSVIEW_PRINTINFO_BITS_RESERVED_ZERO				#language eng  "Bits 7:6 are reserved bits, must be zero\n"

#string STR_SMBIOSVIEW_PRINTINFO_WATCHDOG_TIMER_2				#language eng  "System contains a watchdog timer\n"

#string STR_SMBIOSVIEW_PRINTINFO_SYSTEM_NOT_CONTAIN_TIMER		#language eng  "System does not contain a watchdog timer\n"

#string STR_SMBIOSVIEW_PRINTINFO_BOOT_OPTION_LIMIT				#language eng  "Boot Option on Limit: "

#string STR_SMBIOSVIEW_PRINTINFO_OP_SYSTEM_2					#language eng  "Operating system\n"

#string STR_SMBIOSVIEW_PRINTINFO_SYSTEM_UTIL					#language eng  "System utilities\n"

#string STR_SMBIOSVIEW_PRINTINFO_DO_NOT_REBOOT_BITS				#language eng  "Do not reboot Bits\n"

#string STR_SMBIOSVIEW_PRINTINFO_BOOT_OPTION					#language eng  "Boot Option :"

#string STR_SMBIOSVIEW_PRINTINFO_DO_NOT_REBOOT					#language eng  "Do not reboot\n"

#string STR_SMBIOSVIEW_PRINTINFO_HARDWARE_SECURITY_SET			#language eng  "Hardware Security Settings: \n"

#string STR_SMBIOSVIEW_PRINTINFO_POWER_ON_PASSWORD				#language eng  "Power-on Password Status: "

#string STR_SMBIOSVIEW_PRINTINFO_DISABLED						#language eng  "Disabled\n"

#string STR_SMBIOSVIEW_PRINTINFO_ENABLED_NEWLINE				#language eng  "Enabled\n"

#string STR_SMBIOSVIEW_PRINTINFO_NOT_IMPLEMENTED				#language eng  "Not Implemented\n"
                                       
#string STR_SMBIOSVIEW_PRINTINFO_KEYBOARD_PASSWORD				#language eng  "Keyboard Password Status: "
                                       
#string STR_SMBIOSVIEW_PRINTINFO_ADMIN_PASSWORD_STATUS			#language eng  "Administrator Password Status: "
                                       
#string STR_SMBIOSVIEW_PRINTINFO_FRONT_PANEL_RESET				#language eng  "Front Panel Reset Status: "
                                       
#string STR_SMBIOSVIEW_PRINTINFO_CONNECTIONS					#language eng  "Connections: "
                                      
#string STR_SMBIOSVIEW_PRINTINFO_BITS_RESERVED_ZERO_2			#language eng  "Bits 7:2 are reserved bits, must be zero\n"

#string STR_SMBIOSVIEW_PRINTINFO_OUTBOUND_CONN_ENABLED			#language eng  "Outbound Connection Enabled\n"
                                       
#string STR_SMBIOSVIEW_PRINTINFO_OTUBOUND_CONN_DISABLED			#language eng  "Outbound Connection Disabled\n"
                                       
#string STR_SMBIOSVIEW_PRINTINFO_INBOIUND_CONN_ENABLED			#language eng  "Inbound Connection Enabled\n"
                                       
#string STR_SMBIOSVIEW_PRINTINFO_INBOUND_CONN_DISABLED			#language eng  "Inbound Connection Disabled\n"
                                       
#string STR_SMBIOSVIEW_PRINTINFO_POWER_SUPPLY_CHAR				#language eng  "Power Supply Characteristics: \n"
                                       
#string STR_SMBIOSVIEW_PRINTINFO_BITS_15_14_RSVD				#language eng  "Bits 15:14 are reserved bits, must be zero\n"

#string STR_SMBIOSVIEW_PRINTINFO_TYPE							#language eng  "Type - "
                                       
#string STR_SMBIOSVIEW_PRINTINFO_OTHER_SPACE					#language eng  " Other\n"
                                       
#string STR_SMBIOSVIEW_PRINTINFO_LINEAR							#language eng  " Linear\n"
                                     
#string STR_SMBIOSVIEW_PRINTINFO_SWITCHING						#language eng  " Switching\n"
                                       
#string STR_SMBIOSVIEW_PRINTINFO_BATTERY						#language eng  " Battery\n"
                                       
#string STR_SMBIOSVIEW_PRINTINFO_UPS							#language eng  " UPS\n"
                                       
#string STR_SMBIOSVIEW_PRINTINFO_CONVERTER						#language eng  " Converter\n"
                                       
#string STR_SMBIOSVIEW_PRINTINFO_REGULATOR						#language eng  " Regulator\n"
                                       
#string STR_SMBIOSVIEW_PRINTINFO_RESERVED_2						#language eng  " Reserved \n"
                                       
#string STR_SMBIOSVIEW_PRINTINFO_STATUS_DASH					#language eng  " Status - "
                                       
#string STR_SMBIOSVIEW_PRINTINFO_OK								#language eng  " OK\n"
                                       
#string STR_SMBIOSVIEW_PRINTINFO_NON_CRITICAL					#language eng  " Non-critical\n"
                                       
#string STR_SMBIOSVIEW_PRINTINFO_CRITICAL_POWER_SUPPLY			#language eng  " Critical, power supply has failed and has been taken off-line\n"

#string STR_SMBIOSVIEW_PRINTINFO_UNDEFINED						#language eng  " Undefined \n"
                                       
#string STR_SMBIOSVIEW_PRINTINFO_INPUT_VOLTAGE_RANGE			#language eng  "Input Voltage Range Switching - "
                                       
#string STR_SMBIOSVIEW_PRINTINFO_MANUAL							#language eng  " Manual\n"
                                       
#string STR_SMBIOSVIEW_PRINTINFO_AUTO_SWITCH					#language eng  " Auto-switch\n"
                                       
#string STR_SMBIOSVIEW_PRINTINFO_WIDE_RANGE						#language eng  " Wide range\n"
                                       
#string STR_SMBIOSVIEW_PRINTINFO_NOT_APPLICABLE					#language eng  " Not applicable\n"
                                       
#string STR_SMBIOSVIEW_PRINTINFO_RESERVED_3						#language eng  " Reserved  \n"
                                       
#string STR_SMBIOSVIEW_PRINTINFO_POWER_SUPPLY_UNPLUGGED			#language eng  "Power supply is unplugged from the wall\n"
                                       
#string STR_SMBIOSVIEW_PRINTINFO_POWER_SUPPLY_PLUGGED			#language eng  "Power supply is plugged from the wall\n"
                                       
#string STR_SMBIOSVIEW_PRINTINFO_POWER_SUPPLY_PRESENT			#language eng  "Power supply is present\n"
                                       
#string STR_SMBIOSVIEW_PRINTINFO_POWER_SUPPLY_NOT_PRESENT		#language eng  "Power supply is not present\n"
                                       
#string STR_SMBIOSVIEW_PRINTINFO_POWER_SUPPLY_REPLACE			#language eng  "Power supply is hot replaceable\n"
                                       
#string STR_SMBIOSVIEW_PRINTINFO_POWER_SUPPLY_NOT_REPLACE		#language eng  "Power supply is not hot replaceable\n"
                                       
#string STR_SMBIOSVIEW_PRINTINFO_BIOS_SIZE						#language eng  "BiosSize:  %d KB\n"
                                       
#string STR_SMBIOSVIEW_QUERYTABLE_NO_INFO						#language eng  "No Info"
                                       
#string STR_SMBIOSVIEW_QUERYTABLE_RSVD_BITS_SET					#language eng  "\nIt also has reserved bits set 1 --- reserved bits: 0x%x"

#string STR_SMBIOSVIEW_QUERYTABLE_SYSTEM_WAKEUP_TYPE			#language eng  "System Wakeup Type:"
                                       
#string STR_SMBIOSVIEW_QUERYTABLE_SYSTEM_CHASSIS_TYPE			#language eng  "System Enclosure or Chassis Types:"
                                      
#string STR_SMBIOSVIEW_QUERYTABLE_CHASSIS_LOCK_PRESENT			#language eng  "Chassis Lock present\n"
                                       
#string STR_SMBIOSVIEW_QUERYTABLE_SYSTEM_CHASSIS_STATUS			#language eng  "System Enclosure or Chassis Status: "
                                       
#string STR_SMBIOSVIEW_QUERYTABLE_SYSTEM_CHASSIS_SECURITY		#language eng  "System Enclosure or Chassis Security Status: "
										
#string STR_SMBIOSVIEW_QUERYTABLE_PROC_TYPE						#language eng  "Processor Type: "
                                       
#string STR_SMBIOSVIEW_QUERYTABLE_PROC_UPDATE					#language eng  "Processor Upgrade: "
                                       
#string STR_SMBIOSVIEW_QUERYTABLE_MEM_DETECTMETHOD				#language eng  "Memory Controller Error DetectMethod:"
                                       
#string STR_SMBIOSVIEW_QUERYTABLE_MEM_CORRECT_CAPABILITY		#language eng  "Memory Controller Error Correct Capability:\n"
                                       
#string STR_SMBIOSVIEW_QUERYTABLE_MEM_INTERLEAVE_SUPPORT		#language eng  "Memory Controller Interleave Support:"
                                       
#string STR_SMBIOSVIEW_QUERYTABLE_MEM_MEMORY_SPEED				#language eng  "Memory Controller Memory Speed:"
                                       
#string STR_SMBIOSVIEW_QUERYTABLE_REQUIRED_VOLTAGES				#language eng  "The required voltages for each memory module sockets:\n"

#string STR_SMBIOSVIEW_QUERYTABLE_MEM_MODULE_TYPE				#language eng  "Memory Module Memory Type: "
                                       
#string STR_SMBIOSVIEW_QUERYTABLE_MEM_MODULE_ERROR_STATUS		#language eng  "Memory Module Error Status: "
                                       
#string STR_SMBIOSVIEW_QUERYTABLE_CACHE_SRAM_TYPE				#language eng  "Cache SRAM Type: "
                                       
#string STR_SMBIOSVIEW_QUERYTABLE_CACHE_ERROR_CORRECTING		#language eng  "Cache Error Correcting Type: "
                                       
#string STR_SMBIOSVIEW_QUERYTABLE_CACHE_SYSTEM_TYPE				#language eng  "Cache System Cache Type:"
                                       
#string STR_SMBIOSVIEW_QUERYTABLE_CACHE_ASSOCIATIVITY			#language eng  "Cache Associativity:"
                                       
#string STR_SMBIOSVIEW_QUERYTABLE_PORT_CONNECTOR_TYPE			#language eng  "Port Connector Type: "
                                       
#string STR_SMBIOSVIEW_QUERYTABLE_PORT_TYPE						#language eng  "Port Type: "
                                       
#string STR_SMBIOSVIEW_QUERYTABLE_SYSTEM_SLOT_TYPE				#language eng  "System Slot Type: "
                                       
#string STR_SMBIOSVIEW_QUERYTABLE_SYSTEM_SLOT_DATA				#language eng  "System Slot Data Bus Width: "

#string STR_SMBIOSVIEW_QUERYTABLE_SYSTEM_SLOT_CURRENT_USAGE		#language eng  "System Slot Current Usage: "
                                       
#string STR_SMBIOSVIEW_QUERYTABLE_SYSTEM_SLOT_LENGTH			#language eng  "System Slot Length: "

#string STR_SMBIOSVIEW_QUERYTABLE_SLOT_CHARACTERISTICS			#language eng  "Slot characteristics 1: "
                                       
#string STR_SMBIOSVIEW_QUERYTABLE_SLOT_CHARACTERISTICS_2		#language eng  "Slot characteristics 2: "
                                       
#string STR_SMBIOSVIEW_QUERYTABLE_ONBOARD_DEVICE_TYPE			#language eng  "Onboard Device Type: "
                                       
#string STR_SMBIOSVIEW_QUERYTABLE_SYSTEM_EVENT_LOG_TYPE			#language eng  "System Event Log Type: "
                                       
#string STR_SMBIOSVIEW_QUERYTABLE_EVENT_LOG_VAR_DATA_FORMAT		#language eng  "Event Log Variable Data Format Types: "

#string STR_SMBIOSVIEW_QUERYTABLE_POST_RESULTS_BITMAP			#language eng  "POST Results Bitmap - First DWORD:\n"
                                       
#string STR_SMBIOSVIEW_QUERYTABLE_POST_RESULTS_SECOND_DWORD		#language eng  "POST Results Bitmap - Second DWORD:\n"
                                       
#string STR_SMBIOSVIEW_QUERYTABLE_SYSTEM_MANAGEMENT_TYPES		#language eng  "System Management Types: "
                                       
#string STR_SMBIOSVIEW_QUERYTABLE_OEM_ASSIGNED					#language eng  "OEM assigned\n"
                                      
#string STR_SMBIOSVIEW_QUERYTABLE_RSVD_FOR_FUTURE_ASSIGN		#language eng  "Reserved for future assignment via this specification\n"
                                      
#string STR_SMBIOSVIEW_QUERYTABLE_SYSTEM_MANAGEMENT_PROBE		#language eng  "A system-management probe or cooling device is out-of-range\n"
                                       
#string STR_SMBIOSVIEW_QUERYTABLE_PHYS_MEM_ARRAY_LOCATION		#language eng  "Physical Memory Array Location: "
                                       
#string STR_SMBIOSVIEW_QUERYTABLE_PHYS_MEM_ARRAY_ERROR			#language eng  "Physical Memory Array Error Correction Types: "

#string STR_SMBIOSVIEW_QUERYTABLE_MEM_DEVICE_FORM_FACTOR		#language eng  "Memory Device - Form Factor: "
                                       
#string STR_SMBIOSVIEW_QUERYTABLE_MEM_DEVICE_TYPE				#language eng  "Memory Device - Type: "
                                       
#string STR_SMBIOSVIEW_QUERYTABLE_MEM_DEVICE_TYPE_DETAIL		#language eng  "Memory Device - Type Detail: "
                                       
#string STR_SMBIOSVIEW_QUERYTABLE_MEM_ERROR_INFO				#language eng  "32-bit Memory Error Information - Type: "

#string STR_SMBIOSVIEW_QUERYTABLE_MEM_ERROR_GRANULARITY			#language eng  "Memory Error - Error granularity: "
                                       
#string STR_SMBIOSVIEW_QUERYTABLE_MEM_ERROR_OP					#language eng  "Memory Error - Error Operation: "
                                       
#string STR_SMBIOSVIEW_QUERYTABLE_POINTING_DEVICE_TYPE			#language eng  "Pointing Device - Type: "
                                      
#string STR_SMBIOSVIEW_QUERYTABLE_POINTING_DEVICE_INTERFACE		#language eng  "Pointing Device - Interface:"
                                       
#string STR_SMBIOSVIEW_QUERYTABLE_PORTABLE_BATT_DEV_CHEM		#language eng  "Portable Battery - Device Chemistry:"
                                       
#string STR_SMBIOSVIEW_QUERYTABLE_VOLTAGE_PROBE_LOC				#language eng  "Voltage Probe - Location:"
                                      
#string STR_SMBIOSVIEW_QUERYTABLE_VOLTAGE_PROBE_STATUS			#language eng  "Voltage Probe - Status:"
                                       
#string STR_SMBIOSVIEW_QUERYTABLE_COOLING_DEV_STATUS			#language eng  "Cooling Device - Status: "
                                       
#string STR_SMBIOSVIEW_QUERYTABLE_COOLING_DEV_TYPE				#language eng  "Cooling Device - Type: "
                                       
#string STR_SMBIOSVIEW_QUERYTABLE_TEMP_PROBE					#language eng  "Temperature Probe - Status:"
                                       
#string STR_SMBIOSVIEW_QUERYTABLE_ELEC_PROBE_STATUS				#language eng  "Electrical Current Probe - Status:"
                                       
#string STR_SMBIOSVIEW_QUERYTABLE_ELEC_PROBE_LOC				#language eng  "Electrical Current Probe - Location:"
                                       
#string STR_SMBIOSVIEW_QUERYTABLE_MANAGEMENT_DEV_TYPE			#language eng  "Management Devicey Type:"
                                       
#string STR_SMBIOSVIEW_QUERYTABLE_MANAGEMENT_DEV_ADDR_TYPE		#language eng  "Management Devicey - Address Type:"
										
#string STR_SMBIOSVIEW_QUERYTABLE_MEM_CHANNEL_TYPE				#language eng  "Memory Channel Type:"
                                       
#string STR_SMBIOSVIEW_QUERYTABLE_BMC_INTERFACE_TYPE			#language eng  "BMC Interface Type:"
                                       
#string STR_SMBIOSVIEW_QUERYTABLE_STRUCT_TYPE					#language eng  "Structure Type:"
                                       
#string STR_SMBIOSVIEW_SMBIOSVIEW_ONE_VAR_ARGV					#language eng  "%s "
                                       
#string STR_SMBIOSVIEW_SMBIOSVIEW_QUERY_STRUCT_COND				#language eng  "Query Structure, conditions are:\n"
                                       
#string STR_SMBIOSVIEW_SMBIOSVIEW_QUERYTYPE_RANDOM				#language eng  "QueryType   = Random \n"
                                       
#string STR_SMBIOSVIEW_SMBIOSVIEW_QUERYTYPE						#language eng  "QueryType   = %d\n"
                                      
#string STR_SMBIOSVIEW_SMBIOSVIEW_QUERYHANDLE_RANDOM			#language eng  "QueryHandle = Random\n"
                                       
#string STR_SMBIOSVIEW_SMBIOSVIEW_QUERYHANDLE					#language eng  "QueryHandle = 0x%x\n"
                                       
#string STR_SMBIOSVIEW_SMBIOSVIEW_SHOWTYPE						#language eng  "ShowType    = "
                                       
#string STR_SMBIOSVIEW_SMBIOSVIEW_TYPE_HANDLE_DUMP_STRUCT		#language eng  "Type=%d, Handle=0x%x\nDump Structure as:\n"

#string STR_SMBIOSVIEW_SMBIOSVIEW_INDEX_LENGTH					#language eng  "Index=%d,Length=0x%x,"

#string STR_SMBIOSVIEW_SMBIOSVIEW_ADDR							#language eng  "Addr=0x%x\n"

#string STR_SMBIOSVIEW_SMBIOSVIEW_ENTRYLEN				  #language eng  "Entry Length: 0x%x\n"

#string STR_SMBIOSVIEW_SMBIOSVIEW_REFERENCEDHANDLE	#language eng  "Referenced Handle: 0x%x\n"

#string STR_SMBIOSVIEW_SMBIOSVIEW_REFERENCEDOFFSET	#language eng  "Referenced Offset: 0x%x\n"
                                      
#string STR_SMBIOSVIEW_SMBIOSVIEW_ENTER_Q						#language eng  "\n%HEnter%N to continue, %H:q%N to exit, %H:[0-3]%N to change mode, %H/?%N for help\n"

#string STR_SMBIOSVIEW_SMBIOSVIEW_SMBIOS_UTILITY				#language eng  "   SMBIOS Utility ---- smbiosview HELP Information\n\n"

#string STR_SMBIOSVIEW_SMBIOSVIEW_USAGE							#language eng  "Usage:\n"
                                       
#string STR_SMBIOSVIEW_SMBIOSVIEW_HSMBIOSVIEW					#language eng  "%Hsmbiosview [-t type] | [-h handle] | [-s] | [-a]%N\n"
                                       
#string STR_SMBIOSVIEW_SMBIOSVIEW_EXAMPLES						#language eng  "Examples:\n"
                                       
#string STR_SMBIOSVIEW_SMBIOSVIEW_SHOW_STAT_INFO				#language eng  "%H>smbiosview -s %N         - Show statistics information\n"

#string STR_SMBIOSVIEW_SMBIOSVIEW_SHOW_ALL_STRUCT_TYPE			#language eng  "%H>smbiosview -t 8 %N       - Show all structures of type=8\n"

#string STR_SMBIOSVIEW_SMBIOSVIEW_SHOW_STRUCT_HANDLE			#language eng  "%H>smbiosview -h 25 %N      - Show structure of handle=0x25\n"

#string STR_SMBIOSVIEW_SMBIOSVIEW_SHOW_ALL_OUTPUT_TO_FILE		#language eng  "%H>smbiosview -a > 1.log%N  - Show all and output to file 1.log\n"

#string STR_SMBIOSVIEW_SMBIOSVIEW_INTERNAL_COMMANDS				#language eng  "Internal commands:\n"
                                       
#string STR_SMBIOSVIEW_SMBIOSVIEW_QUIT_SMBIOSVIEW				#language eng  "%H:q%N --------  quit smbiosview\n"
                                      
#string STR_SMBIOSVIEW_SMBIOSVIEW_CHANGE_DISPLAY_NONE			#language eng  "%H:0%N --------  Change smbiosview display NONE info\n"

#string STR_SMBIOSVIEW_SMBIOSVIEW_CHANGE_DISPLAY_OUTLINE		#language eng  "%H:1%N --------  Change smbiosview display OUTLINE info\n"

#string STR_SMBIOSVIEW_SMBIOSVIEW_CHANGE_DISPLAY_NORMAL			#language eng  "%H:2%N --------  Change smbiosview display NORMAL info\n"

#string STR_SMBIOSVIEW_SMBIOSVIEW_CHANGE_DISPLAY_DETAIL			#language eng  "%H:3%N --------  Change smbiosview display DETAIL info\n"

#string STR_SMBIOSVIEW_SMBIOSVIEW_SHOW_HELP						#language eng  "%H/?%N --------  Show help\n"
                                       
#string STR_SMBIOSVIEW_SMBIOSVIEW_INDEX							#language eng  "Index=%04d   "
                                       
#string STR_SMBIOSVIEW_SMBIOSVIEW_TYPE							#language eng  "Type=%03d   "
                                       
#string STR_SMBIOSVIEW_SMBIOSVIEW_HANDLE						#language eng  "Handle=0x%04x   "
                                       
#string STR_SMBIOSVIEW_SMBIOSVIEW_OFFSET						#language eng  "Offset=0x%04x   "
                                       
#string STR_SMBIOSVIEW_SMBIOSVIEW_LENGTH						#language eng  "Length=0x%04x"

#string STR_SMBIOSVIEW_SMBIOSVIEW_ENTER_CONTINUE				#language eng  "Press Enter to continue..\n"
                                       
#string STR_SMBIOSVIEW_LIBSMBIOSVIEW_NO_BUF_SPEC_WHEN_STRUCT	#language eng  "smbiosview: No buffer specified when get structure\n"

#string STR_SMBIOSVIEW_SMBIOSVIEW_NOT_SPEC						#language eng  "SmbiosView: Type # not specified\n"
                                       
#string STR_SMBIOSVIEW_SMBIOSVIEW_HANDLE_NOT_SPEC				#language eng  "SmbiosView: Handle # not specified\n"
                                      
#string STR_SMBIOSVIEW_SMBIOSVIEW_UNKNOWN_FLAG					#language eng  "\nSmbiosView: Unknown flag\n"
                                       
#string STR_SMBIOSVIEW_SMBIOSVIEW_CANNOT_ACCESS_TABLE			#language eng  "SmbiosView: Cannot access SMBIOS table\n"
                                       
#string STR_SMBIOSVIEW_SMBIOSVIEW_UNKNOWN_INTERNAL_COMMAND		#language eng  "\nSmbiosView: Unknown internal command\n"
                                       
#string STR_SMBIOSVIEW_SMBIOSVIEW_SMBIOS_TABLE					#language eng  "SmbiosView: SMBIOS table damaged\n"
                                       
#string STR_SMBIOSVIEW_SMBIOSVIEW_OUT_OF_MEM					#language eng  "SmbiosView: Out of memory\n"
                                       
#string STR_SMBIOSVIEW_SMBIOSVIEW_CANNOT_ACCESS_STATS			#language eng  "SmbiosView: Cannot access statistics table\n"

#string STR_SMBIOSVIEW_LINE_HELP	   #language eng  "Displays SMBIOS information"

#string STR_SMBIOSVIEW_VERBOSE_HELP    #language eng  "Displays SMBIOS information.\n"
                                                      "\n"
                                                      "SMBIOSVIEW [-t SmbiosType]|[-h SmbiosHandle]|[-s]|[-a]\n"
                                                      "\n"
                                                      "    -t            - Display all structures of SmbiosType\n"
                                                      "    SmbiosType    - SMBIOS structure type\n"
                                                      "    -h            - Display structure of SmbiosHandle\n"
                                                      "    SmbiosHandle  - SMBIOS structure unique 16-bit handle\n"
                                                      "    -s            - Display statistics table\n"
                                                      "    -a            - Display all information\n"
                                                      "\n"
                                                      "Notes:\n"
                                                      "    1. The SmbiosType parameter supports the following types:\n"
                                                      "        0  - BIOS Information\n"
                                                      "        1  - System Information\n"
                                                      "        3  - System Enclosure\n"
                                                      "        4  - Processor Information\n"
                                                      "        5  - Memory Controller Information\n"
                                                      "        6  - Memory Module Information\n"
                                                      "        7  - Cache Information\n"
                                                      "        8  - Port Connector Information\n"
                                                      "        9  - System Slots\n"
                                                      "        10 - On Board Devices Information\n"
                                                      "        15 - System Event Log\n"
                                                      "        16 - Physical Memory Array\n"
                                                      "        17 - Memory Device\n"
                                                      "        18 - 32-bit Memory Error Information\n"
                                                      "        19 - Memory Array Mapped Address\n"
                                                      "        20 - Memory Device Mapped Address\n"
                                                      "        21 - Built-in Pointing Device\n"
                                                      "        22 - Portable Battery\n"
                                                      "        34 - Management Device\n"
                                                      "        37 - Memory Channel\n"
                                                      "        38 - IPMI Device Information\n"
                                                      "        39 - System Power Supply\n"
                                                      "    2. The SmbiosHandle parameter is specified in hexadecimal format.\n"
                                                      "       Don't use the '0x' prefix format for hexadecimal values.\n"
                                                      "    3. Internal commands:\n"
                                                      "        :q --------  quit smbiosview\n"
                                                      "        :0 --------  Change smbiosview display NONE info\n"
                                                      "        :1 --------  Change smbiosview display OUTLINE info\n"
                                                      "        :2 --------  Change smbiosview display NORMAL info\n"
                                                      "        :3 --------  Change smbiosview display DETAIL info\n"
                                                      "        /? --------  Show help\n"
 